ua1arn/hftrx/boards/arm_stm32mp1xx_ctlstyle_storch_v9a_R1AB.h
/* $Id$ */
/* board-specific CPU attached signals */
//
// Проект HF Dream Receiver (КВ приёмник мечты)
// автор Гена Завидовский mgs2001@mail.ru
// UA1ARN
//
// Трансивер с DSP обработкой "Аист" на процессоре STM32MP1xx
// rmainunit_v5km7.pcb STM32MP1xx, 2xUSB, NAU8822L и FPGA EP4CE22E22I7N

#ifndef ARM_STM32MP1_LFBGA354_CTLSTYLE_STORCH_V9A_H_INCLUDED
#define ARM_STM32MP1_LFBGA354_CTLSTYLE_STORCH_V9A_H_INCLUDED 1

	#if ! defined(STM32MP153Dxx)
		#error Wrong CPU selected. STM32MP153Dxx expected
	#endif /* ! defined(STM32MP153Dxx) */

	//#define WITHSAICLOCKFROMI2S 1	/* Блок SAI1 тактируется от PLL I2S */
	// в данной конфигурации I2S и SAI - в режиме SLAVE
	#define WITHI2SCLOCKFROMPIN 1	// тактовая частота на SPI2 (I2S) подается с внешнего генератора, в процессор вводится через MCK сигнал интерфейса
	#define WITHSAICLOCKFROMPIN 1	// тактовая частота на SAI1 подается с внешнего генератора, в процессор вводится через MCK сигнал интерфейса

	#define WITHUSEPLL		1	/* Главная PLL	*/
	#define WITHUSEPLL1		1	/* PLL1 - MPU, AXI	*/
	#define WITHUSEPLL2		1	/* PLL2 - GPU, DDR	*/
	//#define WITHUSEPLL3		1	/* PLL3 - для LTDC на STM32H743xx	*/
	#define WITHUSEPLL4		1	/* PLL4 - для LTDC & USBPHY	*/
	//#define WITHUSESAIPLL	1	/* SAI PLL	*/
	//#define WITHUSESAII2S	1	/* I2S PLL	*/

	#define LSEFREQ 32768uL
	#define WITHCPUXTAL 24000000uL	/* На процессоре установлен кварц 24.000 МГц */
	//#define WITHCPUXOSC 24000000uL	/* На процессоре установлен генератор 24.000 МГц */

	//	In addition, if the USBO is used in full-speed mode only, the application can choose the
	//	48 MHz clock source to be provided to the USBO:
	// USBOSRC
	//	0: pll4_r_ck clock selected as kernel peripheral clock (default after reset)
	//	1: clock provided by the USB PHY (rcc_ck_usbo_48m) selected as kernel peripheral clock
	// USBPHYSRC
	//  0x0: hse_ker_ck clock selected as kernel peripheral clock (default after reset)
	//  0x1: pll4_r_ck clock selected as kernel peripheral clock
	//  0x2: hse_ker_ck/2 clock selected as kernel peripheral clock
	#define RCC_USBCKSELR_USBOSRC_VAL 1
	#define RCC_USBCKSELR_USBPHYSRC_VAL 0

	#if WITHISBOOTLOADER
		// Варианты конфигурации тактирования
		// ref1_ck, ref2_ck - 8..16 MHz
		// PLL1, PLL2 VCOs
		#if WITHCPUXTAL || WITHCPUXOSC

			// PLL1_1600
			#define PLL1DIVM	2	// ref1_ck = 12 MHz (8..16 MHz valid)
			#define PLL1DIVP	1	// MPU
			#define PLL1DIVQ	2
			#define PLL1DIVR	2

			//#define PLL1DIVN	54	// 12*54 = 648 MHz
			//#define PLL1DIVN	66	// 12*66 = 792 MHz
			#define PLL1DIVN	(stm32mp1_overdrived() ? 66 : 54)	// Auto select

			// PLL2_1600
	#if 1
			#define PLL2DIVM	2	// ref2_ck = 12 MHz (8..16 MHz valid)
			#define PLL2DIVN	44	// 528 MHz Valid division rations for DIVN: between 25 and 100
			#define PLL2DIVP	2	// AXISS_CK div2=minimum 528/2 = 264 MHz PLL2 selected as AXI sub-system clock (pll2_p_ck) - 266 MHz max for all CPU revisions
			#define PLL2DIVQ	1	// GPU clock divider = 528 MHz - 533 MHz max for all CPU revisions
			#define PLL2DIVR	1	// DDR clock divider = 528 MHz
			//#include "src/sdram/stm32mp15-mx_1G.dtsi"	// 64k*16
			#include "src/sdram/stm32mp15-mx_2G.dtsi"	// 128k*16
			//#include "src/sdram/stm32mp15-mx_4G.dtsi"		// 256k*16
			//#include "src/sdram/stm32mp15-mx_8G.dtsi"	// 512k*16
	#elif 0
			// PLL2_1600
			#define PLL2DIVM	2	// ref2_ck = 12 MHz (8..16 MHz valid)
			#define PLL2DIVN	66	// 528 MHz Valid division rations for DIVN: between 25 and 100
			#define PLL2DIVP	3	// AXISS_CK div2=minimum 528/2 = 264 MHz PLL2 selected as AXI sub-system clock (pll2_p_ck) - 266 MHz max for all CPU revisions
			#define PLL2DIVQ	2	// GPU clock divider = 528 MHz - 533 MHz max for all CPU revisions
			#define PLL2DIVR	2	// DDR clock divider = 528 MHz
			//#include "src/sdram/stm32mp15-mx_1G.dtsi"	// 64k*16
			#include "src/sdram/stm32mp15-mx_2G.dtsi"	// 128k*16
			//#include "src/sdram/stm32mp15-mx_4G.dtsi"		// 256k*16
			//#include "src/sdram/stm32mp15-mx_8G.dtsi"	// 512k*16
	#else
			// PLL2_1600
			/* bad boards DDR3 clock = 300 MHz */
			#define PLL2DIVM	2	// ref2_ck = 12 MHz (8..16 MHz valid)
			#define PLL2DIVN	50	// 600 MHz Valid division rations for DIVN: between 25 and 100
			#define PLL2DIVP	3	// AXISS_CK div2=minimum 1056/4 = 200 MHz PLL2 selected as AXI sub-system clock (pll2_p_ck) - 266 MHz max for all CPU revisions
			#define PLL2DIVQ	2	// GPU clock divider = 300 MHz - 533 MHz max for all CPU revisions
			#define PLL2DIVR	2	// DDR clock divider = 300 MHz
			// less or equal 300 MHz
			// DDR3 timings only 6-6-6 (in  according AN5168
			//#include "src/sdram/stm32mp15-mx_300MHz_1G.dtsi"	// 64k*16
			#include "src/sdram/stm32mp15-mx_300MHz_2G.dtsi"	// 128k*16
			//#include "src/sdram/stm32mp15-mx_300MHz_4G.dtsi"	// 256k*16
			//#include "src/sdram/stm32mp15-mx_300MHz_8G.dtsi"	// 512k*16
	#endif

			// PLL3_800

			// PLL4_800
			#define PLL4DIVM	2	// ref2_ck = 12 MHz (4..16 MHz valid)
			#define PLL4DIVN	64	// 768 MHz
			#define PLL4DIVP	2	// div2
			//#define PLL4DIVQ	19	// LTDC clock divider = 30.315 MHz
			//#define PLL4DIVR	20	// USBPHY clock divider = 38.4 MHz
			//#define PLL4DIVR	24	// USBPHY clock divider = 32 MHz
			//#define PLL4DIVR	32	// USBPHY clock divider = 24 MHz
			#define PLL4DIVR	16	// USBPHY clock divider = 48 MHz (для прямого тактирования USB_OTG FS)

		#else
			// HSI version (HSI=64 MHz)
			// PLL1_1600
			#define PLL1DIVM	5	// ref1_ck = 12.8 MHz (8..16 MHz valid)
			#define PLL1DIVP	1	// MPU
			#define PLL1DIVQ	2
			#define PLL1DIVR	2
			//#define PLL1DIVN	50	// x25..x100: 12.8 * 50 = 640 MHz
			//#define PLL1DIVN	62	// x25..x100: 12.8 * 62 = 793.6 MHz
			#define PLL1DIVN	(stm32mp1_overdrived() ? 62 : 50)	// Auto select

	#if 1
			// PLL2_1600
			#define PLL2DIVM	5	// ref2_ck = 12.8 MHz (8..16 MHz valid)
			#define PLL2DIVN	41	// 12.8 * 41 = 524.8 MHz
			#define PLL2DIVP	2	// div2=minimum PLL2 selected as AXI sub-system clock (pll2_p_ck)
			#define PLL2DIVQ	1	// GPU clock divider
			#define PLL2DIVR	1	// DDR clock divider
			//#include "src/sdram/stm32mp15-mx_1G.dtsi"	// 64k*16
			#include "src/sdram/stm32mp15-mx_2G.dtsi"	// 128k*16
			//#include "src/sdram/stm32mp15-mx_4G.dtsi"		// 256k*16
			//#include "src/sdram/stm32mp15-mx_8G.dtsi"	// 512k*16
	#else
			// PLL2_1600
			#define PLL2DIVM	5	// ref2_ck = 12.8 MHz (8..16 MHz valid)
			#define PLL2DIVN	61//41	// 12.8 * 41 = 524.8 MHz
			#define PLL2DIVP	3//2	// div2=minimum PLL2 selected as AXI sub-system clock (pll2_p_ck)
			#define PLL2DIVQ	2//1	// GPU clock divider
			#define PLL2DIVR	3//1	// DDR clock divider
			// less or equal 300 MHz
			// DDR3 timings only 6-6-6 (in  according AN5168
			//#include "src/sdram/stm32mp15-mx_300MHz_1G.dtsi"	// 64k*16
			#include "src/sdram/stm32mp15-mx_300MHz_2G.dtsi"	// 128k*16
			//#include "src/sdram/stm32mp15-mx_300MHz_4G.dtsi"	// 256k*16
			//#include "src/sdram/stm32mp15-mx_300MHz_8G.dtsi"	// 512k*16
	#endif

			// PLL3_800
			// pll3_p_ck -> mcuss_ck - 209 MHz Max
			#define PLL3DIVM	5	// ref3_ck = 12.8 MHz (4..16 MHz valid)

			// PLL4_800
			#define PLL4DIVM	5	// ref2_ck = 12.8 MHz  (4..16 MHz valid)
			#define PLL4DIVN	60	// 12.8 * 60 = 768 MHz
			#define PLL4DIVP	2	// div2
			//#define PLL4DIVR	20	// USBPHY clock divider = 38.4 MHz
			//#define PLL4DIVR	24	// USBPHY clock divider = 32 MHz
			//#define PLL4DIVR	32	// USBPHY clock divider = 24 MHz
			#define PLL4DIVR	16	// USBPHY clock divider = 48 MHz (для прямого тактирования USB_OTG FS)

		#endif
	#endif /* WITHISBOOTLOADER */

	/* модели синтезаторов - схемы частотообразования */

